roam/import_notes_from_instapaper.org
:PROPERTIES:
:ID:       97d8a318-03f4-4c20-8b83-6ef99a93374c
:END:
#+title: Import Notes from Instapaper
#+date: [2021-12-23 Thu 00:15]
#+filetags: article
- Source: https://adrian-philipp.com/notes/import-notes-from-instapaper
- Author: [[id:94369120-020b-43c3-b952-c63f9c96552d][Adrian Philipp]]
- Related: [[id:3d9f45a2-ddf3-4920-9d09-148cd2fd7b43][Instapaper]]

* Instapaper
- read it later service
- can send articles to Kindle
  + [what about /not/ Kindle dammit]

Adrian doesn't feel like it's worth the pain sending articles to [[id:3d9f45a2-ddf3-4920-9d09-148cd2fd7b43][Instapaper]] to  read them later. He feels it's more exiting to read them on site, when he finds them.
- scraping the articles off markdown files to search for free and fast
  + never run the risk of losing the source

Interesting idea, maybe too much of a pain. Also intense on the memory? It's getting cheaper and cheaper i guess.
