content/posts/import_notes_from_instapaper.md
+++
title = "Import Notes from Instapaper"
date = 2021-12-23T00:15:00+01:00
tags = ["article"]
draft = false
+++

-   Source: <https://adrian-philipp.com/notes/import-notes-from-instapaper>
-   Author: [Adrian Philipp]({{< relref "adrian_philipp.md" >}})
-   Related: [Instapaper]({{< relref "instapaper.md" >}})


## Instapaper {#instapaper}

-   read it later service
-   can send articles to Kindle
    -   [what about _not_ Kindle dammit]

Adrian doesn't feel like it's worth the pain sending articles to [Instapaper]({{< relref "instapaper.md" >}}) to  read them later. He feels it's more exiting to read them on site, when he finds them.

-   scraping the articles off markdown files to search for free and fast
    -   never run the risk of losing the source

Interesting idea, maybe too much of a pain. Also intense on the memory? It's getting cheaper and cheaper i guess.
